/* Промела-модель бесконечного осциллятора */

// глобальная переменная
int sum = 0;

/* Процесс-осциллятор */
active proctype Oscillator() {
    byte v;
    do
    :: (sum > 0) ->
         /* недетерминированно выбираем v ∈ {1,2,3} */
         if :: v = 1
            :: v = 2
            :: v = 3
         fi;
         sum = sum - v

    :: else ->
         /* sum ≤ 0 */
         if :: v = 1
            :: v = 2
            :: v = 3
         fi;
         sum = sum + v
    od
}

/* LTL-свойства */

ltl p1 {    /* 1. sum == 0 бесконечно часто */
    [](<> (sum == 0))
}

ltl p2 {    /* 2. –3 ≤ sum ≤ 3 всегда */
    [] (sum >= -3 && sum <= 3)
}

ltl p3 {    /* 3. если >0 то когда-нибудь <0, и наоборот */
    [] ( (sum > 0)  ->  <> (sum < 0) )
 && [] ( (sum < 0)  ->  <> (sum > 0) )
}
